{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hey",
                "Hi there",
                "Good to see you",
                "Greetings",
                "How's it going",
                "Hola",
                "Hey there",
                "Welcome back",
                "Hi, what's up",
                "Long time no see",
                "Hi friend",
                "What's happening",
                "Hey, howdy",
                "Hi, nice to meet you",
                "Greetings and salutations",
                "Hello, stranger",
                "Hey, what's new",
                "Hi, how's your day",
                "Hey, good to have you here",
                "What's crackin'",
                "Hello, how are things",
                "Hi, it's me again",
                "Hey, nice to see you",
                "Hi, what's the buzz",
                "Hello, how have you been",
                "Hey, what's the word",
                "Hi, how's everything",
                "Greetings, my friend",
                "Hello, how's life treating you",
                "Hey, how's the day treating you",
                "Good day to you",
                "Hey, how are you doing today",
                "Hi, it's a pleasure to meet you",
                "Greetings, how may I assist you",
                "Hey, what's cooking",
                "Hi, any exciting plans today",
                "Hello, hope you're doing well",
                "Hey, what's on your mind",
                "Hi, anything I can help you with",
                "Greetings, how's your day shaping up",
                "Hey, good to have you back",
                "Hi, what brings you here today",
                "Hello, how can I brighten your day",
                "Hey, hope you're having a great day",
                "Hi, anything interesting happening",
                "Greetings, ready for some shopping fun",
                "Hey, what's the latest with you",
                "Hi, how's everything on your end",
                "Hello, hope you're ready for a chat"
            ],
            "responses": [
                "Hello! Welcome to our online store.",
                "Good to see you again! How can I assist you today?",
                "Hi there! How can I help you?",
                "Greetings! Ready to explore our products?",
                "Hey! Welcome back!",
                "Hi! What brings you here today?",
                "Hello! Excited to assist you!",
                "Hey there! How can I make your day better?",
                "Hi, it's Gen! How may I assist you?",
                "Good day! What can I do for you today?",
                "Hey buddy! Ready to find some amazing deals?",
                "Hey! Nice to have you drop by.",
                "Hello, my friend! What's on your mind?",
                "Hi again! Anything specific you're looking for?",
                "Hey, good to see a familiar face! How can I help?",
                "Hello! Ready to dive into our product offerings?",
                "Hey there! What's the scoop?",
                "Hi, nice to meet you! What can I do for you today?",
                "Greetings! How may I make your day better?",
                "Hey! Long time no chat. What's new?",
                "Hi! What's the buzz on your side?",
                "Hello! How's your day going so far?",
                "Hey! Anything exciting happening in your world?",
                "Hi, it's me again! Ready for some fun?",
                "Hello! Nice to see you back. How can I assist?",
                "Hey there! What's the word?",
                "Hi! How's everything in your part of the world?",
                "Greetings, my friend! What can I do for you?",
                "Hello! How's life treating you today?",
                "Hey! What's the latest gossip?",
                "Hi! How's everything going on your end?",
                "Good day to you! Anything I can help with?",
                "Hey! How are you doing today?",
                "Hi! It's a pleasure to meet you.",
                "Greetings! How may I assist you today?",
                "Hey! What's cooking?",
                "Hi! Any exciting plans for today?",
                "Hello! Hope you're doing well.",
                "Hey! What's on your mind?",
                "Hi! Anything I can help you with?",
                "Greetings! How's your day shaping up?",
                "Hey! Good to have you back.",
                "Hi! What brings you here today?",
                "Hello! How can I brighten your day?",
                "Hey! Hope you're having a great day.",
                "Hi! Anything interesting happening?",
                "Greetings! Ready for some shopping fun?",
                "Hey! What's the latest with you?",
                "Hi! How's everything on your end?",
                "Hello! Hope you're ready for a chat."
            ],
            "context_set": ""
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye for now",
                "I'm out",
                "Farewell",
                "Take care",
                "Until next time",
                "Time to go",
                "Adieu",
                "So long",
                "Catch you later",
                "I'm saying goodbye",
                "Gotta run",
                "See you soon",
                "Take it easy",
                "Goodbye, friend",
                "Leaving now",
                "Till we meet again",
                "Off I go",
                "Time to say farewell",
                "Until we chat again",
                "I'm off now",
                "Goodbye, everyone",
                "Wishing you well",
                "Parting is such sweet sorrow",
                "Off to new adventures",
                "Take good care",
                "Saying my goodbyes",
                "Exiting the conversation",
                "Goodbye, my friend"
            ],
            "responses": [
                "Sad to see you go :(",
                "Talk to you later! If you have more questions, feel free to ask.",
                "Goodbye! Have a great day!",
                "Take care! If you need anything else, don't hesitate to ask.",
                "Until next time! Feel free to return anytime.",
                "Farewell! If you change your mind, we'll be here.",
                "Goodbye! Remember, we're just a message away.",
                "See you later! If you ever need assistance, we're here for you.",
                "Adios! If there's anything else you need, let us know.",
                "Goodbye! Thanks for visiting. If you have more questions, feel free to reach out.",
                "Take it easy! We're here whenever you're ready to shop again.",
                "Bye for now! If you think of anything later, drop us a message.",
                "Gotta run! If there's anything urgent, feel free to reach out.",
                "See you soon! If you change your mind about anything, we're here.",
                "Take it easy! If you have more shopping to do, we'll be here.",
                "Goodbye, friend! If you ever miss us, just come back.",
                "Leaving now! If there's anything we can do for you, let us know.",
                "Till we meet again! If you have questions in the future, reach out to us.",
                "Off I go! If you need assistance later, don't hesitate to ask.",
                "Time to say farewell! If there's anything we can do for you, feel free to ask.",
                "Until we chat again! If you have more shopping on your mind, we'll be here.",
                "I'm off now! If you think of anything else, reach out to us.",
                "Goodbye, everyone! If you have friends looking for great deals, send them our way.",
                "Wishing you well! If you ever need assistance, we're just a message away.",
                "Parting is such sweet sorrow! If there's anything you forgot, let us know.",
                "Off to new adventures! If those adventures involve shopping, we're here for you.",
                "Take good care! If there's anything we can assist you with, reach out.",
                "Saying my goodbyes! If you ever want to say hello again, we'll be here.",
                "Exiting the conversation! If there's anything lingering, feel free to ask.",
                "Goodbye, my friend! If you need a friend in the shopping world, we're here."
            ],
            "context_set": ""
        },
        {
            "tag": "name",
            "patterns": [
                "What do they call you?",
                "Your name?",
                "Tell me your name",
                "Who are you?",
                "What should I call you?",
                "Who am I chatting with?",
                "Your name, please?",
                "May I know your name?",
                "What's your name again?",
                "Who's on the line?",
                "Identify yourself",
                "Your given name?",
                "Do you have a name?",
                "What are you called?",
                "Let's talk names",
                "What's the label you go by?",
                "What name do you respond to?",
                "Give me your name",
                "Who goes there?"
            ],
            "responses": [
                "You can call me Gen.",
                "I'm Gen!",
                "I'm Gen, your virtual shopping assistant.",
                "People call me Gen, nice to meet you!",
                "The name's Gen. How can I assist you today?",
                "I go by Gen. What can I do for you?",
                "I'm Gen, your friendly assistant. How can I help?",
                "Call me Gen! Ready to assist you with your queries.",
                "I'm Gen, here to help you find the best deals.",
                "You can call me Gen, your personal shopper.",
                "I'm Gen! How can I make your shopping experience better today?",
                "I'm Gen, the one who's here to assist you!",
                "Yes, I have a name! It's Gen.",
                "You got it right! I'm Gen.",
                "They call me Gen. How may I assist you?",
                "Call me Gen, and let's make your shopping experience amazing!",
                "I'm Gen, at your service!",
                "Gen is the name, and shopping is the game!",
                "You've reached Gen, your virtual shopping companion.",
                "The name to remember is Gen."
            ],
            "context_set": ""
        },
        {
            "tag": "shop",
            "patterns": [
                "I want to make a purchase",
                "Tell me about your products",
                "Lead me to the shopping spree",
                "What's in stock?",
                "Guide me through the store",
                "I'm ready to buy, what now?",
                "Can I browse your offerings?",
                "Help me find something to buy",
                "Take me to the merchandise",
                "I'm in the mood for shopping",
                "Let's get down to shopping",
                "Ready to make a transaction",
                "Where's the shopping section?",
                "Show me the goods",
                "I'm here to shop",
                "Navigate me to the products",
                "What's on the virtual shelves?",
                "Point me to the shopping cart",
                "Let's explore your inventory",
                "I'm here for some retail therapy"
            ],
            "responses": [
                "Welcome to our online store! We have a variety of products. What are you looking for today?",
                "Our selection includes bikes and electronics. Anything specific you'd like to explore?",
                "Sure, let's find the perfect product for you! What type of item are you interested in?",
                "Hungry for great deals? Let's explore our products together!",
                "Great choice! What type of product are you in the mood for?",
                "Let's make your shopping experience delightful! What catches your eye?",
                "Excited to assist you! What category of products are you interested in?",
                "Ready to discover some fantastic products? What's on your wishlist?",
                "Looking for something special? Our store has a wide range of products to choose from.",
                "Feeling like a shopping spree? Our shelves are filled with exciting options.",
                "Eager to assist! What type of product are you in the market for today?",
                "Fantastic! Let's find the perfect item for you. What are you interested in?",
                "You've come to the right place for shopping! What's on your mind?",
                "Excellent choice! Our virtual shelves are ready for your exploration.",
                "Welcome to the shopping zone! What can I help you find today?",
                "You're in for a treat! Our store is packed with amazing products. What are you looking for?",
                "Ready for a virtual shopping adventure? What category are you interested in?",
                "Curious about our offerings? We've got bikes and electronics to cater to your needs. What are you searching for?",
                "Dive into our extensive collection of products, ranging from bikes to cutting-edge electronics. What piques your interest?",
                "Explore the world of shopping with our diverse range of products. What category are you interested in today?",
                "We've got something for everyone, from bikes to top-notch electronics. What can we help you find?"
            ],
            "context_set": ""
        },
        {
            "tag": "time",
            "patterns": [
                "When do you operate?",
                "Tell me your operating hours",
                "What time are you open?",
                "When can I reach you?",
                "What are your business hours?",
                "What's the schedule like?",
                "When are you available?",
                "What time do you close?",
                "Tell me your opening hours",
                "When can I shop?",
                "What's your daily schedule?",
                "Give me your hours of operation",
                "When should I visit?",
                "What's the best time to contact you?",
                "When are you accessible?",
                "Tell me your availability",
                "Give me your working hours",
                "What time can I reach out?",
                "When do you start business?",
                "What are your daily hours?"
            ],
            "responses": [
                "Our online store is open 24/7 for your convenience. You can shop anytime! If you have questions, feel free to ask.",
                "We're here for you 24/7! Feel free to shop whenever suits you best.",
                "You can access our online store 24 hours a day, 7 days a week. How can we assist you today?",
                "Our virtual doors are always open! When you're ready to shop, we're here for you.",
                "No need to worry about closing time! We're available 24/7 for your shopping needs.",
                "You're in luck! We're available around the clock. What can we help you find today?",
                "We understand that time zones vary. That's why our online store is open 24/7 for you.",
                "We've got you covered anytime! Our store is open non-stop. What can we do for you?",
                "Feel free to shop at any hour! Our virtual store is ready when you are.",
                "Our online doors never close! Whenever you're ready to shop, we're here for you.",
                "If you're wondering about our schedule, it's 24/7 availability for your convenience.",
                "You're not restricted by time here! Our online store is at your service 24 hours a day.",
                "We operate around the clock! Feel free to reach out whenever it suits you.",
                "The beauty of online shopping is that we're open 24 hours a day! What can we help you find?",
                "We're always available! Our virtual store is open 24/7 for your shopping pleasure.",
                "You don't need to wait for specific hours – our online store is accessible anytime.",
                "Our schedule is designed for your convenience – 24/7 availability. How can we assist you today?",
                "You can reach out at any time! Our support is available 24 hours a day.",
                "Whenever you're ready, we're here! Our virtual doors never close.",
                "You don't have to worry about business hours – we're open 24/7 for your needs."
            ],
            "context_set": ""
        },
        {
            "tag": "products",
            "patterns": [
                "What kind of products do you offer?",
                "Tell me about your merchandise",
                "Give me a list of your products",
                "What items are in stock?",
                "What's in your inventory?",
                "Describe your product range",
                "Show me your available goods",
                "I want to explore your products",
                "What can I find in your store?",
                "Let's talk about your offerings",
                "Tell me what you sell",
                "Give me details on your products",
                "What's on the product list?",
                "Show me what's available for purchase",
                "Describe the products you have",
                "Tell me about the items you carry",
                "What's in store for me?",
                "Can you show me your selection?",
                "Give me an overview of your products",
                "I'm interested in what you sell"
            ],
            "responses": [
                "We have a diverse range of products, including bikes and electronics. Is there a specific category you're interested in?",
                "Our product selection is vast, featuring the latest in bikes and electronics. What catches your eye?",
                "From bikes to electronics, our store has a wide variety of products. What type of item are you looking for?",
                "Our product lineup includes bikes and electronics. Ready to explore some exciting options?",
                "Curious about our offerings? We've got bikes and electronics to cater to your needs. What are you searching for?",
                "Dive into our extensive collection of products, ranging from bikes to cutting-edge electronics. What piques your interest?",
                "Explore the world of shopping with our diverse range of products. What category are you interested in today?",
                "We've got something for everyone, from bikes to top-notch electronics. What can we help you find?",
                "Ready to discover amazing products? Whether it's bikes or electronics, we have it all.",
                "Our shelves are stocked with a variety of products, from bikes to state-of-the-art electronics. What are you in the mood for?",
                "Exciting choices await you! Are you interested in bikes, electronics, or something else?",
                "Let's talk products! We have a fantastic collection that includes bikes and cutting-edge electronics. What suits your taste?",
                "Our inventory is brimming with options. Whether you're into bikes or the latest gadgets, we've got you covered.",
                "Discover the possibilities! Bikes, electronics, and more our store has something for everyone.",
                "Get ready for a shopping spree! Our products range from stylish bikes to the latest electronic gadgets. What are you looking for?",
                "Interested in browsing our products? From bikes to electronics, we have a variety of options to choose from."
            ],
            "context_set": ""
        },
        {
            "tag": "bikes",
            "patterns": [
                "Show me your bike collection",
                "I'm looking for a new bicycle",
                "Tell me about your bikes",
                "Guide me to the bicycle section",
                "I'm interested in cycling gear",
                "Show me your bicycle options",
                "What kind of bikes do you sell?",
                "Take me to the bikes",
                "I need a new bike",
                "Tell me about your bicycle range",
                "I want to explore your bike selection",
                "What types of bicycles do you have?",
                "Show me your cycling products",
                "Lead me to the bicycle aisle",
                "I'm in the market for a bicycle"
            ],
            "responses": [
                "Explore our bike collection, featuring mountain bikes, road bikes, and city bikes. What type of bike are you interested in?",
                "Our bikes range from stylish city cruisers to high-performance mountain bikes. What suits your cycling needs?",
                "Looking for a new bicycle? We have a diverse range, from urban commuters to rugged mountain bikes.",
                "Navigate to the bicycle section! Our collection includes bikes for every rider. What are you looking for?",
                "Gear up for cycling adventures! Our bicycle options cover everything from casual rides to off-road excursions.",
                "Ready to roll? Our bicycle section has a variety of options for cyclists of all preferences.",
                "Curious about our bikes? We offer a selection that caters to different styles and preferences. What are you searching for?",
                "Hop on over to the bikes! Whether you're into leisure rides or intense cycling, we have the perfect bike for you.",
                "In the market for a new bike? Our bicycle range includes models suitable for various terrains and preferences.",
                "Pedal into our bicycle range! From sleek road bikes to durable mountain bikes, we have options for every rider.",
                "Excited to explore our bike selection? We have bicycles for every type of rider, from beginners to cycling enthusiasts.",
                "Interested in our bikes? Discover a range of options, including hybrid bikes, mountain bikes, and more.",
                "Showcasing our cycling products! Our bikes are designed for comfort, performance, and style. What are you looking for?",
                "Navigate to the bicycle aisle and discover a world of cycling possibilities. What type of bike interests you?",
                "Ready to cycle into new adventures? Explore our bicycle collection, designed to meet different riding preferences.",
                "In the market for a bicycle? Our range includes everything from classic cruisers to high-tech road bikes."
            ],
            "context_set": "products"
        },
        {
            "tag": "electronics",
            "patterns": [
                "Show me your electronic gadgets",
                "I'm interested in tech products",
                "Tell me about your electronics",
                "Guide me to the tech section",
                "I'm looking for electronic devices",
                "Show me your gadgets",
                "What kind of electronics do you sell?",
                "Take me to the electronics",
                "I need a new tech gadget",
                "Tell me about your electronic range",
                "I want to explore your tech selection",
                "What types of electronics do you have?",
                "Show me your tech products",
                "Lead me to the electronics aisle",
                "I'm in the market for electronics"
            ],
            "responses": [
                "Discover our electronics section, featuring smartphones, laptops, and smart home devices. What are you looking for in electronics?",
                "Our electronics range from cutting-edge smartphones to powerful laptops. What tech product interests you?",
                "Looking for electronic devices? Explore our range, including the latest gadgets and tech innovations.",
                "Navigate to the tech section! Our collection includes electronic devices for every tech enthusiast. What are you searching for?",
                "Gear up for tech adventures! Our electronic gadgets cover everything from smart home devices to personal electronics.",
                "Ready to explore the world of gadgets? Our tech section has a variety of options for tech enthusiasts.",
                "Curious about our electronics? We offer a selection that caters to different tech styles and preferences. What are you searching for?",
                "Hop on over to the electronics! Whether you're into smartphones, laptops, or smart devices, we have the perfect tech for you.",
                "In the market for a new tech gadget? Our electronic range includes devices suitable for various needs and preferences.",
                "Dive into our electronic range! From sleek smartphones to advanced smart home devices, we have options for every tech lover.",
                "Excited to explore our tech selection? We have electronics for every type of user, from beginners to tech enthusiasts.",
                "Interested in our electronics? Discover a range of options, including tablets, headphones, and more.",
                "Showcasing our tech products! Our electronic gadgets are designed for performance, innovation, and style. What are you looking for?",
                "Navigate to the electronics aisle and discover a world of tech possibilities. What type of electronic device interests you?",
                "Ready to step into the world of electronics? Explore our electronic collection, designed to meet different tech preferences.",
                "In the market for electronics? Our range includes everything from smartwatches to gaming devices and more."
            ],
            "context_set": "products"
        }
    ]
}  